Revit 2023 API
StructuralSettings.ShowBraceAbove Property
 Whether to show brace symbols above beams in plan views.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2011
Syntax
C#
public bool ShowBraceAbove { get; set; }
Visual Basic
Public Property ShowBraceAbove As Boolean
	Get
	Set
Visual C++
public:
property bool ShowBraceAbove {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace